; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l26_p26_c26_g26)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-person person1 refugio6)
	(at-person person2 refugio7)
	(at-person person3 refugio23)
	(at-person person4 refugio11)
	(at-person person5 refugio25)
	(at-person person6 refugio1)
	(at-person person7 refugio5)
	(at-person person8 refugio4)
	(at-person person9 refugio17)
	(at-person person10 refugio12)
	(at-person person11 refugio7)
	(at-person person12 refugio26)
	(at-person person13 refugio11)
	(at-person person14 refugio15)
	(at-person person15 refugio9)
	(at-person person16 refugio5)
	(at-person person17 refugio26)
	(at-person person18 refugio25)
	(at-person person19 refugio24)
	(at-person person20 refugio12)
	(at-person person21 refugio19)
	(at-person person22 refugio9)
	(at-person person23 refugio16)
	(at-person person24 refugio10)
	(at-person person25 refugio12)
	(at-person person26 refugio15)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person8 comida)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person10 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
	(person-has person14 comida)
	(person-has person16 comida)
	(person-has person17 comida)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person21 comida)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person25 comida)
	(person-has person26 comida)
))
)

; plan
1. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 0 of 26
2. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 0 of 26
3. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 0 of 26
4. (leave box26 refugio6 dron1-der dron1 person1 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio6) (free dron1-der) (person-has person1 medicina)
   goals met: 1 of 26
5. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 1 of 26
6. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 1 of 26
7. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 1 of 26
8. (leave box17 refugio7 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 comida)
   added: (at-box box17 refugio7) (free dron1-izq) (person-has person2 comida)
   goals met: 2 of 26
9. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 2 of 26
10. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 2 of 26
11. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 2 of 26
12. (leave box16 refugio23 dron1-izq dron1 person3 comida)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 comida)
   added: (at-box box16 refugio23) (free dron1-izq) (person-has person3 comida)
   goals met: 3 of 26
13. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 3 of 26
14. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 3 of 26
15. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 3 of 26
16. (move refugio25 refugio17 dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 refugio17)
   goals met: 3 of 26
17. (leave box15 refugio17 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 comida)
   added: (at-box box15 refugio17) (free dron1-izq) (person-has person9 comida)
   goals met: 4 of 26
18. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 4 of 26
19. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 4 of 26
20. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 4 of 26
21. (move refugio25 refugio5 dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 refugio5)
   goals met: 4 of 26
22. (leave box14 refugio5 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio5) (free dron1-izq) (person-has person16 comida)
   goals met: 5 of 26
23. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 5 of 26
24. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 5 of 26
25. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 5 of 26
26. (move refugio25 refugio26 dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 refugio26)
   goals met: 5 of 26
27. (leave box13 refugio26 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio26) (free dron1-izq) (person-has person17 comida)
   goals met: 6 of 26
28. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 6 of 26
29. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 6 of 26
30. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 6 of 26
31. (move refugio25 refugio19 dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 refugio19)
   goals met: 6 of 26
32. (leave box12 refugio19 dron1-izq dron1 person21 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio19) (free dron1-izq) (person-has person21 comida)
   goals met: 7 of 26
33. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 7 of 26
34. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 7 of 26
35. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 7 of 26
36. (move refugio25 refugio10 dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 refugio10)
   goals met: 7 of 26
37. (leave box11 refugio10 dron1-izq dron1 person24 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio10) (free dron1-izq) (person-has person24 comida)
   goals met: 8 of 26
38. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 8 of 26
39. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 8 of 26
40. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 8 of 26
41. (leave box10 refugio25 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio25) (free dron1-izq) (person-has person5 comida)
   goals met: 9 of 26
42. (move refugio25 deposito dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 deposito)
   goals met: 9 of 26
43. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 9 of 26
44. (move deposito refugio25 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio25)
   goals met: 9 of 26
45. (leave box25 refugio25 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio25) (free dron1-der) (person-has person5 medicina)
   goals met: 10 of 26
46. (move refugio25 deposito dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 deposito)
   goals met: 10 of 26
47. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 10 of 26
48. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 10 of 26
49. (leave box9 refugio1 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio1) (free dron1-izq) (person-has person6 comida)
   goals met: 11 of 26
50. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 11 of 26
51. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 11 of 26
52. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 11 of 26
53. (leave box24 refugio1 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio1) (free dron1-der) (person-has person6 medicina)
   goals met: 12 of 26
54. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 12 of 26
55. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 12 of 26
56. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 12 of 26
57. (leave box8 refugio4 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio4) (free dron1-izq) (person-has person8 comida)
   goals met: 13 of 26
58. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 13 of 26
59. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 13 of 26
60. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 13 of 26
61. (leave box23 refugio4 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio4) (free dron1-der) (person-has person8 medicina)
   goals met: 14 of 26
62. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 14 of 26
63. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 14 of 26
64. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 14 of 26
65. (leave box7 refugio11 dron1-izq dron1 person4 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio11) (free dron1-izq) (person-has person4 comida)
   goals met: 15 of 26
66. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 15 of 26
67. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 15 of 26
68. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 15 of 26
69. (leave box22 refugio11 dron1-der dron1 person4 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio11) (free dron1-der) (person-has person4 medicina)
   goals met: 16 of 26
70. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 16 of 26
71. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 16 of 26
72. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 16 of 26
73. (leave box6 refugio11 dron1-izq dron1 person13 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio11) (free dron1-izq) (person-has person13 comida)
   goals met: 17 of 26
74. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 17 of 26
75. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 17 of 26
76. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 17 of 26
77. (leave box21 refugio11 dron1-der dron1 person13 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio11) (free dron1-der) (person-has person13 medicina)
   goals met: 18 of 26
78. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 18 of 26
79. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 18 of 26
80. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 18 of 26
81. (leave box5 refugio24 dron1-izq dron1 person19 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio24) (free dron1-izq) (person-has person19 comida)
   goals met: 19 of 26
82. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 19 of 26
83. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 19 of 26
84. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 19 of 26
85. (leave box20 refugio24 dron1-der dron1 person19 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio24) (free dron1-der) (person-has person19 medicina)
   goals met: 20 of 26
86. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 20 of 26
87. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 20 of 26
88. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 20 of 26
89. (leave box4 refugio16 dron1-izq dron1 person23 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio16) (free dron1-izq) (person-has person23 comida)
   goals met: 21 of 26
90. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 21 of 26
91. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 21 of 26
92. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 21 of 26
93. (leave box19 refugio16 dron1-der dron1 person23 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio16) (free dron1-der) (person-has person23 medicina)
   goals met: 22 of 26
94. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 22 of 26
95. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 22 of 26
96. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 22 of 26
97. (leave box18 refugio12 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio12) (free dron1-der) (person-has person10 medicina)
   goals met: 23 of 26
98. (leave box3 refugio12 dron1-izq dron1 person25 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio12) (free dron1-izq) (person-has person25 comida)
   goals met: 24 of 26
99. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 24 of 26
100. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 24 of 26
101. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 24 of 26
102. (leave box2 refugio15 dron1-der dron1 person14 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio15) (free dron1-der) (person-has person14 comida)
   goals met: 25 of 26
103. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 25 of 26
104. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 25 of 26
105. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 25 of 26
106. (leave box1 refugio15 dron1-der dron1 person26 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio15) (free dron1-der) (person-has person26 comida)
   goals met: 26 of 26
